<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads, packages and imports into Munki latest version of Apache Ant</string>
		<key>Identifier</key>
		<string>com.github.n8felton.munki.Ant</string>
		<key>Input</key>
		<dict>
			<key>DISPLAY_NAME</key>
			<string>Apache Ant</string>
			<key>NAME</key>
			<string>Ant</string>
			<key>MUNKI_CATEGORY</key>
			<string>Software Development</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>%NAME%</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>Apache Ant is a Java library and command-line tool whose mission is to drive processes described in build files as targets and extension points dependent upon each other. The main known usage of Ant is the build of Java applications.</string>
				<key>developer</key>
				<string>Apache Software Foundation</string>
				<key>display_name</key>
				<string>%DISPLAY_NAME%</string>
				<key>name</key>
				<string>%NAME%</string>
			</dict>
		</dict>
		<key>ParentRecipe</key>
		<string>com.github.n8felton.pkg.Ant</string>
		<key>MinimumVersion</key>
		<string>0.3.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pkg_path%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
		</array>
	</dict> 
</plist>
