<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Apache Ant binaries</string>
		<key>Identifier</key>
		<string>com.github.n8felton.download.Ant</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Ant</string>
			<key>DOWNLOAD_URL</key>
			<string>https://mirrors.ocf.berkeley.edu/apache/ant/binaries</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
					<key>re_pattern</key>
					<string>(?P&lt;filename&gt;apache-ant-(?P&lt;version&gt;.+?)-bin.tar.bz2)</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%/%filename%</string>
					<key>filename</key>
					<string>%filename%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict> 
</plist>
