<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads, packages and imports the latest version of Node.js into Munki</string>
		<key>Identifier</key>
		<string>com.github.n8felton.munki.node</string>
		<key>Input</key>
		<dict>
			<key>DISPLAY_NAME</key>
			<string>Node.js</string>
			<key>NAME</key>
			<string>Node</string>
			<key>MUNKI_CATEGORY</key>
			<string>Developer Tools</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/%NAME%</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>Node.js® is a platform built on Chrome's JavaScript runtime for easily building fast, scalable network applications</string>
				<key>developer</key>
				<string>Node.js Foundation</string>
				<key>display_name</key>
				<string>%DISPLAY_NAME%</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>ParentRecipe</key>
		<string>com.github.n8felton.pkg.node</string>
		<key>MinimumVersion</key>
		<string>0.3.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>postinstall_script</key>
						<string>#!/bin/bash
npm install npm@latest -g</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>/tmp/%NAME%-%VERSION%.pkg</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
		</array>
	</dict> 
</plist>
