<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads, packages and imports into Munki latest version of Apache Maven</string>
		<key>Identifier</key>
		<string>com.github.n8felton.munki.Maven</string>
		<key>Input</key>
		<dict>
			<key>DISPLAY_NAME</key>
			<string>Apache Maven</string>
			<key>NAME</key>
			<string>Maven</string>
			<key>MUNKI_CATEGORY</key>
			<string>Software Development</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>%NAME%</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>Apache Maven is a software project management and comprehension tool. Based on the concept of a project object model (POM), Maven can manage a project's build, reporting and documentation from a central piece of information.</string>
				<key>developer</key>
				<string>Apache Software Foundation</string>
				<key>display_name</key>
				<string>%DISPLAY_NAME%</string>
				<key>name</key>
				<string>%NAME%</string>
			</dict>
		</dict>
		<key>ParentRecipe</key>
		<string>com.github.n8felton.pkg.Maven</string>
		<key>MinimumVersion</key>
		<string>0.3.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pkg_path%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
		</array>
	</dict> 
</plist>
