<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages a the latest version of Apache Maven</string>
	<key>Identifier</key>
	<string>com.github.n8felton.pkg.Maven</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Maven</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.Maven</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkgdirs</key>
				<dict>
					<key>usr</key>
					<string>0755</string>
					<key>usr/local</key>
					<string>0755</string>
					<key>usr/local/bin</key>
					<string>0755</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/*/</string>
				<key>destination_path</key>
				<string>%pkgroot%/usr/local/maven-%version%</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Symlinker</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>/usr/local/maven-%version%</string>
				<key>destination_path</key>
				<string>%pkgroot%/usr/local/maven</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Symlinker</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>/usr/local/maven/bin/maven</string>
				<key>destination_path</key>
				<string>%pkgroot%/usr/local/bin/maven</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%pkgroot%</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>id</key>
					<string>org.apache.maven</string>
					<key>version</key>
					<string>%version%</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>usr</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>0755</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict> 
</plist>
